In [ ]:
# Write a lambda function to rearrange positive and negative numbers in a given list

In [123]:
original_list = [-1,2,-3,4,-5,6,-7,8,-9,10,-11,12]
reorder1 = list(filter(lambda x: (x > 0), original_list))
reorder1.sort(key=lambda x:x, reverse=False)
reorder2 = list(filter(lambda x:(x < 0),original_list))
reorder2.sort(key=lambda x:x,reverse=False)
reordered = reorder1 + reorder2
print(reordered)

df = pd.read_csv("JEOPARDY_DATA.csv")

[2, 4, 6, 8, 10, 12, -11, -9, -7, -5, -3, -1]

In [13]:
import numpy as np 
import pandas as pd

In [124]:

df[' Value'] = df[' Value'].replace('[/$,]', '', regex=True )
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,200,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,200,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,200,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,200,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,200,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [125]:
import numpy as np 
import pandas as pd
df = pd.read_csv("JEOPARDY_DATA.csv")
df.columns

Index(['Show Number', ' Air Date', ' Round', ' Category', ' Value',
       ' Question', ' Answer'],
      dtype='object')

In [126]:
df[ ' Value' ] = df[' Value'].replace('[/$  ,]','',regex = True).astype(float)

df.columns = df.columns.str.strip()
df.head()

,Show Number,Air Date,Round,Category,Value,Question,Answer
0,4680,12/31/2004,Jeopardy!,HISTORY,200.0,"For the last 8 years of his life, Galileo was ...",Copernicus
1,4680,12/31/2004,Jeopardy!,ESPN's TOP 10 ALL-TIME ATHLETES,200.0,No. 2: 1912 Olympian; football star at Carlisl...,Jim Thorpe
2,4680,12/31/2004,Jeopardy!,EVERYBODY TALKS ABOUT IT...,200.0,The city of Yuma in this state has a record av...,Arizona
3,4680,12/31/2004,Jeopardy!,THE COMPANY LINE,200.0,"In 1963, live on ""The Art Linkletter Show"", th...",McDonald's
4,4680,12/31/2004,Jeopardy!,EPITAPHS & TRIBUTES,200.0,"Signer of the Dec. of Indep., framer of the Co...",John Adams

In [100]:
df.dtypes

Show Number      int64
Air Date        object
Round           object
Category        object
Value          float64
Question        object
Answer          object
dtype: object

In [106]:
df = pd.get_dummies( df , columns = ["Round"]) 
df.dtypes

Round_True    bool
dtype: object

In [102]:
# 3) It's inconvenient because when you are trying to work with data sets that use money and want to visualize it as a limited number , rather than multiple digit decimals because python is not able to accurately depict moy/currency

SyntaxError: invalid syntax (1625068800.py, line 4)